mysql> SELECT no, name FROM sample21;
+------+--------+
| no   | name   |
+------+--------+
|    1 | 박준용 |
|    2 | 김재진 |
|    3 | 홍길동 |
+------+--------+
3 rows in set (0.00 sec)

mysql> SELECT address, name FROM sample21;
+-------------------+--------+
| address           | name   |
+-------------------+--------+
| 대구광역시 수성구 | 박준용 |
| 대구광역시 동구   | 김재진 |
| 서울특별시 마포구 | 홍길동 |
+-------------------+--------+
3 rows in set (0.00 sec)

-- 예제 2-2 
mysql> SELECT * FROM sample21 WHERE no=2;
+------+--------+----------+-----------------+
| no   | name   | birthday | address         |
+------+--------+----------+-----------------+
|    2 | 김재진 | NULL     | 대구광역시 동구 |
+------+--------+----------+-----------------+
1 row in set (0.00 sec)

--예제 2-3
mysql> SELECT * FROM sample21 WHERE no<>2;
+------+--------+------------+-------------------+
| no   | name   | birthday   | address           |
+------+--------+------------+-------------------+
|    1 | 박준용 | 1976-10-18 | 대구광역시 수성구 |
|    3 | 홍길동 | NULL       | 서울특별시 마포구 |
+------+--------+------------+-------------------+
2 rows in set (0.00 sec)

--예제 2-4 
mysql>  SELECT * FROM sample21 WHERE name = '박준용';
+------+--------+------------+-------------------+
| no   | name   | birthday   | address           |
+------+--------+------------+-------------------+
|    1 | 박준용 | 1976-10-18 | 대구광역시 수성구 |
+------+--------+------------+-------------------+
1 row in set (0.00 sec)

--예제 2-5 
mysql> SELECT * FROM sample21 WHERE birthday=NULL;
Empty set (0.00 sec)

--예제 2-6 
mysql> SELECT * FROM sample21 WHERE birthday IS NULL;
+------+--------+----------+-------------------+
| no   | name   | birthday | address           |
+------+--------+----------+-------------------+
|    2 | 김재진 | NULL     | 대구광역시 동구   |
|    3 | 홍길동 | NULL     | 서울특별시 마포구 |
+------+--------+----------+-------------------+
2 rows in set (0.00 sec)