-- 예제 3-1

mysql> SELECT * FROM sample31;
+------+------+-------------------+
| name | age  | address           |
+------+------+-------------------+
| A씨  |   36 | 대구광역시 중구   |
| B씨  |   18 | 부산광역시 연제구 |
| C씨  |   25 | 서울특별시 중구   |
+------+------+-------------------+
mysql> SELECT * FROM sample31 ORDER BY age;
+------+------+-------------------+
| name | age  | address           |
+------+------+-------------------+
| B씨  |   18 | 부산광역시 연제구 |
| C씨  |   25 | 서울특별시 중구   |
| A씨  |   36 | 대구광역시 중구   |
+------+------+-------------------+
3 rows in set (0.00 sec)

--예제 3-2
mysql> SELECT * FROM sample31 ORDER BY address;
+------+------+-------------------+
| name | age  | address           |
+------+------+-------------------+
| A씨  |   36 | 대구광역시 중구   |
| B씨  |   18 | 부산광역시 연제구 |
| C씨  |   25 | 서울특별시 중구   |
+------+------+-------------------+
3 rows in set (0.00 sec)

--예제 3-3
mysql>  SELECT * FROM sample31 ORDER BY age DESC;
+------+------+-------------------+
| name | age  | address           |
+------+------+-------------------+
| A씨  |   36 | 대구광역시 중구   |
| C씨  |   25 | 서울특별시 중구   |
| B씨  |   18 | 부산광역시 연제구 |
+------+------+-------------------+
3 rows in set (0.00 sec)

mysql> SELECT * FROM sample31 ORDER BY age ASC;
+------+------+-------------------+
| name | age  | address           |
+------+------+-------------------+
| B씨  |   18 | 부산광역시 연제구 |
| C씨  |   25 | 서울특별시 중구   |
| A씨  |   36 | 대구광역시 중구   |
+------+------+-------------------+
3 rows in set (0.00 sec)

--예제 3-4 
mysql> SELECT * FROM sample311;
+------+------+
| a    | b    |
+------+------+
| 1    |    1 |
| 2    |    2 |
| 10   |   10 |
| 11   |   11 |
+------+------+
4 rows in set (0.00 sec)

--예제 3-5
mysql> SELECT * FROM sample311 ORDER BY a;
+------+------+
| a    | b    |
+------+------+
| 1    |    1 |
| 10   |   10 |
| 11   |   11 |
| 2    |    2 |
+------+------+
4 rows in set (0.0